import './AutomationAr.css';
import { Link } from 'react-router-dom';

function Automation() {
    return (
        <div className='info-block'>
            <p className='automation-more'>قدم الشركة خدمات في اختيار وتوريد ودمج الروبوتات الصناعية والخلايا المؤتمتة "تحت مفتاح واحد". وشركاؤنا هم 
                     OMRON و KUKA و FANUK و YASKAVA و DJI و SIEMENS
</p>
            <p className='automation-more'>تخصص شركتنا في تطوير وإنتاج الخلايا المؤتمتة، والمهمة الرئيسية لها هي تطبيق المواد السائلة ذات اللزوجة العالية على منتجات العملاء. وتستخدم هذه التقنيات على نطاق واسع في صناعة السيارات والهندسة الميكانيكية والأجهزة العلمية.</p>
            <p className='automation-more'>تتيح خلايا الروبوت التي نقوم بتصنيعها تحديد نوعية المواد بدقة عالية وتطبيقها على قطع العملاء بأي تكوين بدقة عالية أيضًا. وتتميز خلايا الروبوت التي ننتجها بالدقة العالية في قياس المواد وتطبيقها على قطع العملاء بأي تكوين، مما يتيح لنا تحقيق نتائج ممتازة في صناعة السيارات والهندسة الميكانيكية وصناعات الأجهزة.</p>
            <Link className='button' to='/ar'>عد</Link>
        </div>

    )
}

export default Automation;